Revit 2026 API

# FamilySymbolSetStructuralSection Method

---

Sets the structural section in element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetStructuralSection(
	StructuralSection structuralSection
)
```
```vb
Public Sub SetStructuralSection (
	structuralSection As StructuralSection
)
```
```cpp
public:
void SetStructuralSection(
	StructuralSection^ structuralSection
)
```
```fsharp
member SetStructuralSection :
        structuralSection : StructuralSection -> unit
```

#### Parameters

structuralSection StructuralSection
     Structural section with values that will be set.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | This FamilySymbol cannot have a structural section. |

Only beams, braces and structural columns can have a structural section. To check if the element can have structural section use the CanHaveStructuralSection method.

#### Reference

FamilySymbol Class

Autodesk.Revit.DB Namespace